
//число 0-999=строка
"use strict"
function getStringNum(digit) {
    let num = digit;
    let a = 0;
    let b=0;
    let c=0;
    let rez=null;
    if (num < 0 || num > 999) {
        rez=" Incorrect ";
    }
    for (var i = 1; i <=num; i++) {
        a = a + 1;
        if (a==10) {
            a = 0;
            b = b + 1;
        }
        if (b==10) {
            b = 0;
            c = c + 1;
        }
    }
    let A = [ "Ноль", "Один", "Два", "Три", "Четыре", "Пять", "Шесть", "Семь", "Восемь", "Девять" ];
    let B = [ "Десять", "Одиннадцать", "Двенадцать", "Тринадцать", "Четырнадцать", "Пятнадцать", "Шестнадцать", "Семнадцать", "Восемнадцать", "Девятнадцать" ];
    let C = [ "", "", "Двадцать", "Тридцать", "Сорок", "Пятьдесят", "Шестьдесят", "Семьдесят", "Восемьдесят", "Девяносто" ];
    let D = [" ", "Сто", "Двести", "Триста", "Четыреста", "Пятьсот", "Шестьсот", "Семьсот", "Восемьсот", "Девятьсот"];
    if (b==1) {
        rez = D[c] + " " + B[a];
    }
    if (b!=1) {
        rez = D[c] + " " + C[b] + " " + A[a];
    }
    
    return rez;
}
